Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services_for_older_people/tax_relief_on_nursing_home_fees_and_for_dependent_relatives.html.txt.tmx
Source language: en
Languages: ga

source: Tax relief on nursing home fees and for dependent relatives
ga: Faoiseamh Cánach ar Tháillí Tithe Altranais agus ar son Gaolta

source: Income tax relief is available on fees paid for nursing homes
ga: Tá fáil ar fhaoiseamh ó cháin ioncaim ar tháillí a íoctar as tithe altranais

source: There also are a number of other tax reliefs for carers and people with disabilities
ga: Tá roinnt faoisimh eile chánach ann do chúramóirí agus do dhaoine atá faoi mhíchumas

source: You claim tax relief for nursing home fees under the general scheme for tax relief on medical expenses
ga: Éilíonn tú faoiseamh cánach ar tháillí teach altranais faoin scéim ghinearálta d’fhaoiseamh canach ar chostais leighis

source: Tax relief on nursing home fees applies at the highest rate of income tax that you pay
ga: Cuirtear an faoiseamh cánach ar tháillí tithe altranais i bhfeidhm ar an ráta is airde de cháin ioncaim a íocann tú

source: If you are paying the charges for a nursing home you can claim the tax relief, whether you are in the nursing home yourself or you are paying for another person to be there
ga: Má tá na muirir á n-íoc agat ar theach altranais, féadfaidh tú an faoiseamh cánach a éileamh, cibé acu má tá tú sa teach altranais tú féin nó má tá tú ag íoc as duine eile a bheith ann

source: Usually you claim the tax relief at the end of the year but in certain circumstances tax relief may be available in the current year through the PAYE system
ga: De ghnáth, éilíonn tú an faoiseamh cánach ag deireadh na bliana cánach, ach faoi roinnt cúinsí, d’fhéadfadh an faoiseamh cánach a bheith ar fáil sa bhliain reatha tríd an gcóras ÍMAT

source: See Revenue’s information leaflet IT 6 Medical Expenses Relief
ga: Féach bileog faisnéise na gCoimisinéirí Ioncaim IT 6 Faoiseamh ar Chostais Liachta

source: For further information, including how to apply, see our document on taxation and medical expenses
ga: Chun teacht ar a thuilleadh faisnéise, lena n-áirítear conas iarratas a dhéanamh, féach ár gcáipéis ar chánachas agus costais leighis

source: You can claim tax relief on the cost of employing a carer for yourself or for another family member
ga: Féadfaidh tú faoiseamh cánach a éileamh ar an gcostas chun cúramóir a fhostú duit féin nó do dhuine muinteartha eile

source: If you are caring for a dependent relative you may qualify for the Dependent Relative Tax Credit
ga: Má tá cúram á thabhairt agat do ghaol cleithiúnach, d’fhéadfá cáiliú don Chreidmheas Cánach do Ghaolta Cleithiúnacha

source: A deed of covenant is a legally binding agreement that is written down and agreed between two people stating that one agrees to pay money to the other without getting any benefit in return
ga: Comhaontú atá ina cheanglas dlíthiúil is ea gníomhas cúnaint a ndéanann beirt daoine a scríobh síos agus a chomhaontú ina luaitear go gcomhaontaíonn duine amháin chun airgead a íoc leis an duine eile gan aon tairbhe a fháil mar thoradh air

source: Tax relief on a Deed of Covenant is available if it is made to a permanently incapacitated minor, permanently incapacitated adult, or person over 65 years of age
ga: Tá fáil ar fhaoiseamh cánach ar Ghníomhas Cúnaint má dhéantar é le mionaoiseach atá ar éagumas buan, le duine fásta atá ar éagumas buan, nó le duine os cionn 65 bliain d’aois

source: There are also a number of other tax reliefs for people with disabilities
ga: Anuas air sin, tá roinnt faoisimh chánacha eile ann do dhuine atá faoi mhíchumas
